dev/villaverde/models/Colonos.php

    public function getFullName($id)
    {
        $model=Colonos::findOne($id);
---
SELECT * FROM `Colonos` WHERE `id`=3