dev/villaverde/models/DetallePagos.php

SELECT `DetallePagos`.* FROM `DetallePagos` LEFT JOIN `Pagos` ON `DetallePagos`.`idPago` = `Pagos`.`id` WHERE `idInmuebleColono`=1 ORDER BY `idEjercicio` DESC, `id` DESC
SELECT * FROM `DetallePagos` WHERE `id`='21'
---
    public function ultimaPagoRegistrado($idInmuebleColono) {

        $model = null;

        $connection = Yii::$app->getDb();

        $ultimoPago = DetallePagos::find()->joinWith('idPago0')->where([
            'idInmuebleColono' => $idInmuebleColono,

        ])->orderBy('idEjercicio desc, id desc')->one();

        $sql = "select d.id, d.idPago, p.idInmuebleColono from Pagos  p
            left join DetallePagos d on p.id = d.idPago
            where p.idInmuebleColono = :idInmuebleColono
            and p.estatus ='activo'
            and d.estatus ='activo'
            order by d.idEjercicio desc, d.idMes desc
            limit 1";


        $command = $connection->createCommand($sql)->bindValue(':idInmuebleColono', $idInmuebleColono);

        $data = $command->queryOne();

        if($data) {
            $model = (new DetallePagos())->findOne($data['id']);