dev/villaverde/models/LoginForm.php

    public function login()
    {
        if ($this->validate()) {

            $session = Yii::$app->session;

            $idTalonActivo = 0;

            if($this->getUser()->tipo==Usuarios::_ADMIN) {

                $modelSesion =(new Sesiones())->find()->where([
                    'idUsuario' => $this->getUser()->id
                ])->one();
---
SELECT * FROM `Sesiones` WHERE `idUsuario`=2