dev/villaverde/models/Meses.php

SELECT * FROM `Meses` ORDER BY `id`
---
    public function lista()
    {
        $arr = ArrayHelper::map(
            Meses::find()
                ->orderBy('id')
                ->all(),
            'id',
            'nombre'
        );