dev/villaverde/models/Pagos.php

    public function siguienteFolio($talon){

        $folioActual = (new Pagos())->find()->where([
            'idTalon' => $talon->id
        ])->max('folio');
---
SELECT MAX(folio) FROM `Pagos` WHERE `idTalon`=1