dev/villaverde/models/Talones.php

SELECT * FROM `Talones` WHERE `estatus`='abierto' ORDER BY `numero`
---
    public function lista()
    {
        $arr = ArrayHelper::map(
            Talones::find()
                ->where(['estatus'=>'abierto'])
                ->orderBy('numero')
                ->all(),
            'id',
            'numero'
        );