dev/villaverde/controllers/InmueblesColonosController.php

SELECT COUNT(*) FROM `InmueblesColonos` WHERE `idColono`='2'
SELECT * FROM `InmueblesColonos` WHERE `idColono`='2'
---
    public function actionListaAjax($idColono)
    {
        $countInmuebles = InmueblesColonos::find()->where(['idColono' => $idColono])->count();

        $arrInmuebles = InmueblesColonos::find()->where(
            [
                'idColono' => $idColono,
                // Tambien verificar estatus
            ]
        )->all();