dev/villaverde/controllers/PagosController.php

SELECT * FROM `Talones` WHERE `id`=1
---
    public function actionCreate()
    {
        $ultimoPago = (new DetallePagos())->ultimaPagoRegistrado(1);

        $talonActivo = (new Talones())->findOne(Yii::$app->session->get('idTalon'));

SELECT * FROM `Pagos` WHERE (`idInmuebleColono`='1') AND (`estatus`='activo') ORDER BY `fecha` DESC
SELECT * FROM `DetallePagos` WHERE (`idPago`=8) AND (`estatus`='activo') ORDER BY `idEjercicio` DESC, `idMes` DESC
SELECT * FROM `Ejercicios` WHERE `id`=2
---
    public function actionUltimoPago($idInmuebleColono){

        $ultimoPago = (new Pagos())->find()->where(
            [
                'idInmuebleColono'=>$idInmuebleColono,
                'estatus' => Pagos::ESTATUS_ACTIVO
            ]
        )->orderBy('fecha desc')->one();

        if($ultimoPago){
            // Obtener ultima mensualidad de este pago

            $ultimaMensualidad = (new DetallePagos())->find()->where([
                'idPago' => $ultimoPago->id,
                'estatus'=> DetallePagos::ESTATUS_ACTIVO
            ])->orderBy('idEjercicio desc, idMes desc')->one();

            $mes  = (new Meses())->texto($ultimaMensualidad->idMes);
            $ejercicio =  (new Ejercicios())->findOne($ultimaMensualidad->idEjercicio);